In [ ]:
lst_names = ['chetan','bruhanth','aishwarya','shabbir','sindhu']
lst_job = ['Faculty','Research','Developer','Developer','Developer']
lst_hobbies = [['cricket','reading'],['reading'],['travelling'],['reading'],['reading']]

<html>
    <table>
        <tr>
            <th>index</th><th> 0 </th><th> 1</th><th> 2</th><th> 3</th><th> 4</th>
        </tr>
        <tr>
            <td>lst_names</td><td>chetan</td><td>bruhanth</td><td>aishwarya</td><td>shabbir</td><td>sindhu</td>
        </tr>
        <tr>
            <td>lst_job</td><td>Faculty</td><td>Research</td><td>Developer</td><td>Developer</td><td>Developer</td>
        </tr>
        <tr>
            <td>lst_hobbies</td><td>cricket,reading</td><td>reading</td><td>travelling</td><td>reading</td><td>reading</td>
        </tr>
    </table>
</html>

In [ ]:
index = lst_names.index('bruhanth')
lst_job[index]

In [ ]:
dict_profile_1 ={'Name':'chetan','Job':'Faculty','hobbies':['cricket','reading'],}
dict_profile_2 = {'Name':'bruhanth','Job':'Research','hobbies':['reading']}
dict_profile_3 = {'Name':'aishwarya','Job':'Developer','hobbies':['travelling']}
dict_profile_4 = {'Name':'shabbir','Job':'Developer','hobbies':['reading']}
dict_profile_5 = {'Name':'sindhu','Job':'Developer','hobbies':['reading']}
lst_profiles = list([dict_profile_1,dict_profile_2,dict_profile_3,dict_profile_4,dict_profile_5])

<html>
    <table >
        <tr>
            <th>index</th><th> 0 </th><th> 1 </th><th> 2</th><th> 3</th><th> 4</th>
        </tr>
        <tr>
            <td>Name</td><td>chetan</td><td>bruhanth</td><td>aishwarya</td><td>shabbir</td><td>sindhu</td>
        </tr>
        <tr>
            <td>Job</td><td>Faculty</td><td>Research</td><td>Developer</td><td>Developer</td><td>Developer</td>
        </tr>
        <tr>
            <td>hobbies</td><td>cricket,reading</td><td>reading</td><td>travelling</td><td>reading</td><td>reading</td>
        </tr>
    </table>
</html>

In [ ]:
lst_profiles[0]['hobbies']

dict_profiles = dict({'chetan':dict_profile_1,'bruhanth':dict_profile_2,
                     'aishwarya':dict_profile_3,'shabbir':dict_profile_4,
                     'sindhu':dict_profile_5})

<html>
    <table >
        <tr>
            <th>key</th><th> Name </th><th> Job </th><th>Hobbies</th>
        </tr>
        <tr>
            <td>chetan</td><td>chetan</td><td>Faculty</td><td>reading,cricket</td>
        </tr>
        <tr>
            <td>bruhanth</td><td>bruhanth</td><td>Research</td><td>reading</td>
        </tr>
        <tr>
            <td>aishwarya</td><td>aishwarya</td><td>Developer</td><td>travelling</td>
        </tr>
        <tr>
            <td>shabbir</td><td>shabbir</td><td>Developer</td><td>reading</td>
        </tr>
        <tr>
            <td>sindhu</td><td>sindhu</td><td>Developer</td><td>reading</td>
        </tr>
    </table>
</html>

In [1]:
dict_profiles['chetan']['Name']

# Pandas Datastructures

In [1]:
import pandas as pd

In [2]:
import numpy as np

## Dataframe

In [8]:
df_student = pd.DataFrame()
df_student['Name'] = ['Harry Potter','Ronald Weasley','Harmoine Grenger']
df_student['Branch'] = ['ECE','CSE','ECE']
df_student['Hobbies'] = ['Football,Cricket','Chess','Reading']

In [9]:
df_student

               Name Branch           Hobbies
0      Harry Potter    ECE  Football,Cricket
1    Ronald Weasley    CSE             Chess
2  Harmoine Grenger    ECE           Reading

## Series

In [10]:
ser_1 = pd.Series(['Draco','Civil','Bowling,Horse Riding'],index = ['Name','Branch','Hobbies'])
ser_1

Name                      Draco
Branch                    Civil
Hobbies    Bowling,Horse Riding
dtype: object

In [11]:
df_student.append(ser_1,ignore_index= True)

               Name Branch               Hobbies
0      Harry Potter    ECE      Football,Cricket
1    Ronald Weasley    CSE                 Chess
2  Harmoine Grenger    ECE               Reading
3             Draco  Civil  Bowling,Horse Riding

# Load DataSet

In [12]:
import pandas as pd

## Read books.csv dataset

## Get top 5 and bottom 5 entries of the dataset

## Get the datatypes of the columns in the dataset

## Get the number of entries and columns of the dataset

## Get the columns of the dataset

## Get the complete description of all the columns

## Get the count of each of the author/authors publication

## Get the index of the dataset

# Filter the Data

## Get the first five rows of the dataset

## Get all the rows selecting the collumns title ,authors and language_code

## Get the titles written by only J.K. Rowling

## Get the titles written by either J.K. Rowling or Stephen King

## Get the titles of the books which contain Harry Potter

# Operations on DataFrame

## Sort the dataset w.r.t title column

## Add a new column grade . Assign grade A for ratings between 4-5, B for ratings between 3-4 and C for any rating below 3

# GroupBy

## Use occupation dataset from occupation.csv

## Identify the occupation where female workers are more in number compared to male workers. Also get the difference number. Plot the result as occupation vs the number of jobs for male and female in one graph

## Categorize male and female works who fall in different age group. Get the age group approximated to multiples of 10. (10,20,30,40.. i.e any age between 10 to 20 has to approximated to 20 , between 20 to 30 to 30 and so on..). Plot the appropriate graph

## Load tips dataset

## Calculate the tips given by male and female on particular day of the week. Plot an appropriate graph showing days of the week , tips given by male and female for all the days of the week